-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/khaykingleb/Desktop/Personal/Work/HSE/Current_Semester/Stata-Co
> urse/seminars/sem_04/log_2.log
  log type:  text
 opened on:  17 May 2021, 17:13:08

. use card-2.dta, clear

. 
. // Создаем дополнительные переменные
. gen lwage = ln(wage)

. gen exper = age - educ - 6 //опыт работы

. gen expersq = exper * exper

. 
. // Саммари
. sum age educ exper wage black smsa south

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      3,010     28.1196    3.137004         24         34
        educ |      3,010    13.26346    2.676913          1         18
       exper |      3,010    8.856146    4.141672          0         23
        wage |      3,010    577.2824    262.9583        100       2404
       black |      3,010    .2335548    .4231624          0          1
-------------+---------------------------------------------------------
        smsa |      3,010    .7129568    .4524571          0          1
       south |      3,010    .4036545    .4907113          0          1

. 
. // Переменная motheduc содержат значительное количество пропущенных значений. Соз
> дайте дамми-переменную для пропущенных значений по этой переменной (meduc_miss), 
> затем пропущенные значения в переменной motheduc замените среднем значением в пер
> еменной motheduc.
. sum motheduc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    motheduc |      2,657    10.34814    3.179671          0         18

. 
. gen meduc_miss = .
(3,010 missing values generated)

. replace meduc_miss = 1 if motheduc == .
(353 real changes made)

. replace meduc_miss = 0 if motheduc != .
(2,657 real changes made)

.  
. mean motheduc

Mean estimation                   Number of obs   =      2,657

--------------------------------------------------------------
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
    motheduc |   10.34814    .061686      10.22718    10.46909
--------------------------------------------------------------

. 
. replace motheduc = 10.34814 if motheduc == .
(353 real changes made)

. 
. // Определить количество и долю замененных (пропущенных) значений
. sum meduc_miss // 0.1172757 — доля

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  meduc_miss |      3,010    .1172757     .321802          0          1

. tab meduc_miss // 353 — количество

 meduc_miss |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,657       88.27       88.27
          1 |        353       11.73      100.00
------------+-----------------------------------
      Total |      3,010      100.00

. 
. // Создайте дамми-переменную (low_motheduc), равную 1, если motheduc<=8.
. 
. gen low_motheduc = . // или просто gen low_motheduc = (motheduc <= 8)
(3,010 missing values generated)

. replace low_motheduc = 1 if motheduc <= 8
(748 real changes made)

. replace low_motheduc = 0 if motheduc > 8
(2,262 real changes made)

. 
. // Какова доля респондентов, у которых мать имеет образование не выше 8 классов?
. tab low_motheduc // 24.85 %

low_mothedu |
          c |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,262       75.15       75.15
          1 |        748       24.85      100.00
------------+-----------------------------------
      Total |      3,010      100.00

. 
. // Уравнение заработной платы
. reg lwage educ exper expersq black smsa south smsa66

      Source |       SS           df       MS      Number of obs   =     3,010
-------------+----------------------------------   F(7, 3002)      =    175.96
       Model |  172.420328         7  24.6314755   Prob > F        =    0.0000
    Residual |  420.221316     3,002  .139980452   R-squared       =    0.2909
-------------+----------------------------------   Adj R-squared   =    0.2893
       Total |  592.641645     3,009  .196956346   Root MSE        =    .37414

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0738504   .0035069    21.06   0.000     .0669742    .0807266
       exper |   .0835163   .0066471    12.56   0.000     .0704829    .0965497
     expersq |  -.0022462   .0003178    -7.07   0.000    -.0028694   -.0016231
       black |   -.187532   .0176928   -10.60   0.000    -.2222232   -.1528409
        smsa |   .1444326   .0200278     7.21   0.000     .1051631    .1837022
       south |  -.1232102   .0151657    -8.12   0.000    -.1529464   -.0934741
      smsa66 |   .0255278   .0189249     1.35   0.177    -.0115792    .0626349
       _cons |    4.73136    .067615    69.98   0.000     4.598783    4.863936
------------------------------------------------------------------------------

. // => При увеличении образования на один год заработная плата растет на 7.4% 
. //    Adj R-squared = 0.2893
. // Q: Почему коэффициент β_1 может быть смещенным? Что может являться источником 
> эндогенности в данном уравнении?
. // A: Коэффициент может быть смешенным, если регрессор коррелирует с ошибками. Во
> зможные источники эндогенности: пропуск переменных, ошибки измерения, самоотбор 
. // Скорее всего, оценка β_1 смещена, поскольку мы пропустили переменную skills, п
> отому наш регрессор коррелирует с ошибками (чем способнее человек, тем выше у нег
> о уровень образования)
. 
. // Следующее уравнение
. gen educ_exper = educ * exper

. reg lwage educ exper expersq educ_exper

      Source |       SS           df       MS      Number of obs   =     3,010
-------------+----------------------------------   F(4, 3005)      =    183.45
       Model |  116.315601         4  29.0789003   Prob > F        =    0.0000
    Residual |  476.326043     3,005  .158511163   R-squared       =    0.1963
-------------+----------------------------------   Adj R-squared   =    0.1952
       Total |  592.641645     3,009  .196956346   Root MSE        =    .39813

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0803773   .0105065     7.65   0.000     .0597766     .100978
       exper |    .058353    .025274     2.31   0.021      .008797     .107909
     expersq |   -.001759    .000655    -2.69   0.007    -.0030433   -.0004747
  educ_exper |   .0013468   .0010399     1.30   0.195    -.0006921    .0033858
       _cons |   4.698636    .190472    24.67   0.000     4.325168    5.072105
------------------------------------------------------------------------------

. 
. 
. // Рассчитайте среднее число лет обучения для респондентов, проживавших рядом и н
> е рядом с колледжем с 4-летней программой обучения (переменная nearc4)
. ttest educ, by(nearc4)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     957    12.69801    .0902371    2.791523    12.52093     12.8751
       1 |   2,053    13.52703    .0569511    2.580455    13.41535    13.63872
---------+--------------------------------------------------------------------
combined |   3,010    13.26346    .0487923    2.676913    13.16779    13.35912
---------+--------------------------------------------------------------------
    diff |            -.829019    .1036988               -1.032347   -.6256912
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -7.9945
Ho: diff = 0                                     degrees of freedom =     3008

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. // Q: Являются различия между этими средними статистически значимыми?
. // A: Да, являются при любом разумном уровне значимости.
. 
. // Постройте матрицу корреляции между educ motheduc iq lwage (звездочками обознач
> ьте значимость коэффициентов: * - на 10% уровне, ** - на 5% уровне, *** - на 1% у
> ровне)
. pwcorr educ motheduc iq lwage, sig 

             |     educ motheduc       iq    lwage
-------------+------------------------------------
        educ |   1.0000 
             |
             |
    motheduc |   0.4167   1.0000 
             |   0.0000
             |
          iq |   0.5103   0.2961   1.0000 
             |   0.0000   0.0000
             |
       lwage |   0.3142   0.2027   0.2129   1.0000 
             |   0.0000   0.0000   0.0000
             |

.  
  is not a valid command name
r(199);

end of do-file

r(199);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. ivregress 2sls lwage exper expersq black smsa south smsa66 (educ = nearc4 low_mot
> heduc)

Instrumental variables (2SLS) regression          Number of obs   =      3,010
                                                  Wald chi2(7)    =     731.24
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.2021
                                                  Root MSE        =     .39636

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1418595   .0264154     5.37   0.000     .0900862    .1936328
       exper |   .1114157   .0128333     8.68   0.000      .086263    .1365684
     expersq |   -.002294   .0003372    -6.80   0.000    -.0029549   -.0016331
       black |  -.1199705   .0320361    -3.74   0.000    -.1827601    -.057181
        smsa |   .1175382   .0236035     4.98   0.000     .0712762    .1638001
       south |  -.1007391   .0182426    -5.52   0.000     -.136494   -.0649842
      smsa66 |   .0132222   .0205996     0.64   0.521    -.0271522    .0535966
       _cons |   3.589125   .4450478     8.06   0.000     2.716847    4.461403
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black smsa south smsa66 nearc4 low_motheduc

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. version 13 // version control

. clear all // cleans memory from data

. set more off // cancel pauses 

. capture log close // closes open log file. На самом деле 2 команды: capture + log
>  close
