-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/khaykingleb/Desktop/Personal/Work/HSE/Current_Semester/Stata-Co
> urse/seminars/sem_03/log_2.log
  log type:  text
 opened on:  17 May 2021, 17:13:31

. use card1.dta, clear

. 
. sum educ, detail

                  years of schooling, 1976
-------------------------------------------------------------
      Percentiles      Smallest
 1%            6              1
 5%            9              2
10%           10              3       Obs               2,433
25%           12              3       Sum of Wgt.       2,433

50%           12                      Mean           13.17838
                        Largest       Std. Dev.      2.714225
75%           16             18
90%           17             18       Variance       7.367016
95%           18             18       Skewness      -.2080584
99%           18             18       Kurtosis        3.22714

. 
. sum educ

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        educ |      2,433    13.17838    2.714225          1         18

. 
. recode educ (min/11 = 1 "1–11") (12/15 = 2 "12–15") (16/max = 3 "16+"), gen(educ_
> g)
(2432 differences between educ and educ_g)

. 
. tab educ_g

  RECODE of |
educ (years |
         of |
 schooling, |
      1976) |      Freq.     Percent        Cum.
------------+-----------------------------------
       1–11 |        432       17.76       17.76
      12–15 |      1,363       56.02       73.78
        16+ |        638       26.22      100.00
------------+-----------------------------------
      Total |      2,433      100.00

. 
. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. 
. reg lwage ib2.educ_g exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(6, 2426)      =    145.24
       Model |  125.281847         6  20.8803078   Prob > F        =    0.0000
    Residual |  348.779115     2,426  .143767154   R-squared       =    0.2643
-------------+----------------------------------   Adj R-squared   =    0.2625
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37917

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      educ_g |
       1–11  |  -.2529344   .0243455   -10.39   0.000    -.3006745   -.2051943
        16+  |   .2870227   .0209714    13.69   0.000      .245899    .3281464
             |
       exper |   .0788574   .0079402     9.93   0.000     .0632871    .0944277
     expersq |  -.0025272   .0003778    -6.69   0.000    -.0032679   -.0017864
       black |  -.1802636   .0187634    -9.61   0.000    -.2170575   -.1434696
       south |  -.1772462    .016866   -10.51   0.000    -.2103195   -.1441729
       _cons |   5.887036   .0417896   140.87   0.000     5.805089    5.968983
------------------------------------------------------------------------------

. 
. gen inter_var = .
(2,433 missing values generated)

. replace inter_var = 1 if educ_g == 1
(432 real changes made)

. replace inter_var = 0 if educ_g == 3
(638 real changes made)

. 
. 
. ttest wage, by(inter_var) 

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     638     679.895    11.63323    293.8398    657.0509    702.7391
       1 |     432    434.3588    9.093305    189.0008    416.4861    452.2315
---------+--------------------------------------------------------------------
combined |   1,070    580.7626    8.667199    283.5115     563.756    597.7693
---------+--------------------------------------------------------------------
    diff |            245.5362    15.99657                214.1479    276.9245
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  15.3493
Ho: diff = 0                                     degrees of freedom =     1068

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. 
end of do-file

. help ivregress

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage ib2.educ_g exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(6, 2426)      =    145.24
       Model |  125.281847         6  20.8803078   Prob > F        =    0.0000
    Residual |  348.779115     2,426  .143767154   R-squared       =    0.2643
-------------+----------------------------------   Adj R-squared   =    0.2625
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37917

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      educ_g |
       1–11  |  -.2529344   .0243455   -10.39   0.000    -.3006745   -.2051943
        16+  |   .2870227   .0209714    13.69   0.000      .245899    .3281464
             |
       exper |   .0788574   .0079402     9.93   0.000     .0632871    .0944277
     expersq |  -.0025272   .0003778    -6.69   0.000    -.0032679   -.0017864
       black |  -.1802636   .0187634    -9.61   0.000    -.2170575   -.1434696
       south |  -.1772462    .016866   -10.51   0.000    -.2103195   -.1441729
       _cons |   5.887036   .0417896   140.87   0.000     5.805089    5.968983
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. estimates store model_1

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. estimates store model_1

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. estimates store model_2

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. suest model_1 model_2
ivregress is not supported by suest
r(322);

end of do-file

r(322);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage ib2.educ_g exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(6, 2426)      =    145.24
       Model |  125.281847         6  20.8803078   Prob > F        =    0.0000
    Residual |  348.779115     2,426  .143767154   R-squared       =    0.2643
-------------+----------------------------------   Adj R-squared   =    0.2625
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37917

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      educ_g |
       1–11  |  -.2529344   .0243455   -10.39   0.000    -.3006745   -.2051943
        16+  |   .2870227   .0209714    13.69   0.000      .245899    .3281464
             |
       exper |   .0788574   .0079402     9.93   0.000     .0632871    .0944277
     expersq |  -.0025272   .0003778    -6.69   0.000    -.0032679   -.0017864
       black |  -.1802636   .0187634    -9.61   0.000    -.2170575   -.1434696
       south |  -.1772462    .016866   -10.51   0.000    -.2103195   -.1441729
       _cons |   5.887036   .0417896   140.87   0.000     5.805089    5.968983
------------------------------------------------------------------------------

. 
end of do-file

. exp(-.2529344 )
command exp is unrecognized
r(199);

. help exponent

. exp(-0.2529344)
command exp is unrecognized
r(199);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. ivregress 2sls lwage exper expersq black south (educ = iq), first

First-stage regressions
-----------------------

                                                Number of obs     =      1,613
                                                F(   5,   1607)   =     283.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4684
                                                Adj R-squared     =     0.4668
                                                Root MSE          =     1.6730

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |  -.4822148   .0472664   -10.20   0.000     -.574925   -.3895045
     expersq |   .0104395   .0024898     4.19   0.000     .0055559    .0153231
       black |   .0681641   .1240364     0.55   0.583    -.1751262    .3114543
       south |   .0005826   .0913312     0.01   0.995    -.1785582    .1797234
          iq |   .0500678   .0031941    15.68   0.000     .0438029    .0563328
       _cons |   11.98874   .4391293    27.30   0.000     11.12741    12.85006
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. 
. reg lwage ib2.educ_g exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(6, 2426)      =    145.24
       Model |  125.281847         6  20.8803078   Prob > F        =    0.0000
    Residual |  348.779115     2,426  .143767154   R-squared       =    0.2643
-------------+----------------------------------   Adj R-squared   =    0.2625
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37917

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      educ_g |
       1–11  |  -.2529344   .0243455   -10.39   0.000    -.3006745   -.2051943
        16+  |   .2870227   .0209714    13.69   0.000      .245899    .3281464
             |
       exper |   .0788574   .0079402     9.93   0.000     .0632871    .0944277
     expersq |  -.0025272   .0003778    -6.69   0.000    -.0032679   -.0017864
       black |  -.1802636   .0187634    -9.61   0.000    -.2170575   -.1434696
       south |  -.1772462    .016866   -10.51   0.000    -.2103195   -.1441729
       _cons |   5.887036   .0417896   140.87   0.000     5.805089    5.968983
------------------------------------------------------------------------------

. 
end of do-file

. help test

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. 
. test _b[model_1:educ] = _b[model_2:educ]
equation model_1 not found
r(111);

end of do-file

r(111);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. estimates store model_1

. 
. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. estimates store model_2

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. test _b[model_1:educ] = _b[model_2:educ]
equation model_1 not found
r(111);

end of do-file

r(111);

. help reg

. help sureg

. help name regression

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg eq1: lwage educ exper expersq black south
variable eq1 not found
r(111);

end of do-file

r(111);

. help test

. help eqno

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. estimates store model_1

. 
. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. estimates store model_2

. 
. suest model_1 model_2
ivregress is not supported by suest
r(322);

end of do-file

r(322);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. 
. ttest wage, by(inter_var) 

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     638     679.895    11.63323    293.8398    657.0509    702.7391
       1 |     432    434.3588    9.093305    189.0008    416.4861    452.2315
---------+--------------------------------------------------------------------
combined |   1,070    580.7626    8.667199    283.5115     563.756    597.7693
---------+--------------------------------------------------------------------
    diff |            245.5362    15.99657                214.1479    276.9245
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  15.3493
Ho: diff = 0                                     degrees of freedom =     1068

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. ivregress 2sls lwage exper expersq black south (educ = iq), first

First-stage regressions
-----------------------

                                                Number of obs     =      1,613
                                                F(   5,   1607)   =     283.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4684
                                                Adj R-squared     =     0.4668
                                                Root MSE          =     1.6730

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       exper |  -.4822148   .0472664   -10.20   0.000     -.574925   -.3895045
     expersq |   .0104395   .0024898     4.19   0.000     .0055559    .0153231
       black |   .0681641   .1240364     0.55   0.583    -.1751262    .3114543
       south |   .0005826   .0913312     0.01   0.995    -.1785582    .1797234
          iq |   .0500678   .0031941    15.68   0.000     .0438029    .0563328
       _cons |   11.98874   .4391293    27.30   0.000     11.12741    12.85006
------------------------------------------------------------------------------


Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. 
. 
. 
. reg lwage educ exper expersq black south

      Source |       SS           df       MS      Number of obs   =     2,433
-------------+----------------------------------   F(5, 2427)      =    192.03
       Model |  134.381641         5  26.8763283   Prob > F        =    0.0000
    Residual |   339.67932     2,427  .139958517   R-squared       =    0.2835
-------------+----------------------------------   Adj R-squared   =    0.2820
       Total |  474.060961     2,432  .194926382   Root MSE        =    .37411

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0767915    .003856    19.91   0.000       .06923    .0843529
       exper |   .0753968   .0074007    10.19   0.000     .0608844    .0899092
     expersq |  -.0019942   .0003494    -5.71   0.000    -.0026793   -.0013091
       black |  -.1746641    .018486    -9.45   0.000    -.2109141   -.1384141
       south |  -.1696771   .0166248   -10.21   0.000    -.2022774   -.1370768
       _cons |   4.879832   .0752804    64.82   0.000     4.732211    5.027452
------------------------------------------------------------------------------

. estimates store model_1

. 
. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. estimates store model_2

. 
. suest model_1 model_2
ivregress is not supported by suest
r(322);

end of do-file

r(322);

. help test

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. test _b[eg lwage educ exper expersq black south:educ] = _b[eg lwage educ exper ex
> persq black south:educ]
equation eglwageeducexperexpersqblacksouth not found
r(111);

end of do-file

r(111);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. test _b[eg lwage educ exper expersq black south:educ] = _b[eg lwage educ exper ex
> persq black south:educ]
equation eglwageeducexperexpersqblacksouth not found
r(111);

end of do-file

r(111);

. test eq reg lwage educ exper expersq black south
eq not found
r(111);

. eq reg lwage educ exper expersq black south

. test [[[eqno1=eqno2][educ]][eq reg lwage educ exper expersq black south, eq reg l
> wage ib2.educ_g exper expersq black south]
equation [ not found
r(303);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. ivregress 2sls lwage exper expersq black south (educ = iq)

Instrumental variables (2SLS) regression          Number of obs   =      1,613
                                                  Wald chi2(5)    =     254.92
                                                  Prob > chi2     =     0.0000
                                                  R-squared       =     0.1679
                                                  Root MSE        =     .37607

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .1245463   .0143404     8.69   0.000     .0964397    .1526529
       exper |    .107039   .0136755     7.83   0.000     .0802355    .1338426
     expersq |  -.0026941   .0005924    -4.55   0.000    -.0038551   -.0015331
       black |  -.1137176   .0274864    -4.14   0.000    -.1675901   -.0598452
       south |  -.1210161   .0205294    -5.89   0.000    -.1612529   -.0807793
       _cons |   3.987283   .2635693    15.13   0.000     3.470696    4.503869
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   exper expersq black south iq

. estat overid
no overidentifying restrictions
r(498);

end of do-file

r(498);

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. estat endogenous

  Tests of endogeneity
  Ho: variables are exogenous

  Durbin (score) chi2(1)          =  12.6339  (p = 0.0004)
  Wu-Hausman F(1,1606)            =  12.6783  (p = 0.0004)

. 
end of do-file

. do "/var/folders/ww/4125jjb51pj3363rfldx4rm00000gn/T//SD12640.000000"

. estat firststage

  First-stage regression summary statistics
  --------------------------------------------------------------------------
               |            Adjusted      Partial
      Variable |   R-sq.       R-sq.        R-sq.     F(1,1607)   Prob > F
  -------------+------------------------------------------------------------
          educ |  0.4684      0.4668       0.1326       245.714    0.0000
  --------------------------------------------------------------------------


  Minimum eigenvalue statistic = 245.714     

  Critical Values                      # of endogenous regressors:    1
  Ho: Instruments are weak             # of excluded instruments:     1
  ---------------------------------------------------------------------
                                     |    5%     10%     20%     30%
  2SLS relative bias                 |         (not available)
  -----------------------------------+---------------------------------
                                     |   10%     15%     20%     25%
  2SLS Size of nominal 5% Wald test  |  16.38    8.96    6.66    5.53
  LIML Size of nominal 5% Wald test  |  16.38    8.96    6.66    5.53
  ---------------------------------------------------------------------


. 
end of do-file

